In [1]:
import pandas as pd

In [2]:
df=pd.read_csv("employees.csv")

In [3]:
df.size  # Gives rows X columns i.e number of elements

550

In [ ]:
df.ndim # Gives Dimension

2

In [5]:
df.shape  # gives shape i.e rows and columns

(50, 11)

In [ ]:
df.dtypes  # Gives datatypes

EMPLOYEE_ID        int64
FIRST_NAME        object
LAST_NAME         object
EMAIL             object
PHONE_NUMBER      object
HIRE_DATE         object
JOB_ID            object
SALARY             int64
COMMISSION_PCT    object
MANAGER_ID        object
DEPARTMENT_ID      int64
dtype: object

In [8]:
df.head(2)  # Displays first two rows

,EMPLOYEE_ID,FIRST_NAME,LAST_NAME,EMAIL,PHONE_NUMBER,HIRE_DATE,JOB_ID,SALARY,COMMISSION_PCT,MANAGER_ID,DEPARTMENT_ID
0,198,Donald,OConnell,DOCONNEL,650.507.9833,21-JUN-07,SH_CLERK,2600,-,124,50
1,199,Douglas,Grant,DGRANT,650.507.9844,13-JAN-08,SH_CLERK,2600,-,124,50

In [9]:
df.tail(2)   # Displays last two row

,EMPLOYEE_ID,FIRST_NAME,LAST_NAME,EMAIL,PHONE_NUMBER,HIRE_DATE,JOB_ID,SALARY,COMMISSION_PCT,MANAGER_ID,DEPARTMENT_ID
48,139,John,Seo,JSEO,650.121.2019,12-FEB-06,ST_CLERK,2700,-,123,50
49,140,Joshua,Patel,JPATEL,650.121.1834,06-APR-06,ST_CLERK,2500,-,123,50

In [ ]:
df.sample()  # gives a sample at random

,EMPLOYEE_ID,FIRST_NAME,LAST_NAME,EMAIL,PHONE_NUMBER,HIRE_DATE,JOB_ID,SALARY,COMMISSION_PCT,MANAGER_ID,DEPARTMENT_ID
33,124,Kevin,Mourgos,KMOURGOS,650.123.5234,16-NOV-07,ST_MAN,5800,-,100,50

In [11]:
df.sample(n=4) # gives a 4 samples at random

,EMPLOYEE_ID,FIRST_NAME,LAST_NAME,EMAIL,PHONE_NUMBER,HIRE_DATE,JOB_ID,SALARY,COMMISSION_PCT,MANAGER_ID,DEPARTMENT_ID
18,109,Daniel,Faviet,DFAVIET,515.124.4169,16-AUG-02,FI_ACCOUNT,9000,-,108,100
40,131,James,Marlow,JAMRLOW,650.124.7234,16-FEB-05,ST_CLERK,2500,-,121,50
0,198,Donald,OConnell,DOCONNEL,650.507.9833,21-JUN-07,SH_CLERK,2600,-,124,50
28,119,Karen,Colmenares,KCOLMENA,515.127.4566,10-AUG-07,PU_CLERK,2500,-,114,30

In [ ]:
df.values  # coverts dataframe into Numpy array

In [ ]:
df.axes  # Gives Range as well as information about DataFrame

[RangeIndex(start=0, stop=50, step=1),
 Index(['EMPLOYEE_ID', 'FIRST_NAME', 'LAST_NAME', 'EMAIL', 'PHONE_NUMBER',
        'HIRE_DATE', 'JOB_ID', 'SALARY', 'COMMISSION_PCT', 'MANAGER_ID',
        'DEPARTMENT_ID'],
       dtype='object')]

In [ ]:
df.empty # Tells if  a Dataframe is empty

False

In [ ]:
df.T    # Gives Transpose of data  rows get converted to columns and cols to rows

,0,1,2,3,4,5,6,7,8,9,...,40,41,42,43,44,45,46,47,48,49
EMPLOYEE_ID,198,199,200,201,202,203,204,205,206,100,...,131,132,133,134,135,136,137,138,139,140
FIRST_NAME,Donald,Douglas,Jennifer,Michael,Pat,Susan,Hermann,Shelley,William,Steven,...,James,TJ,Jason,Michael,Ki,Hazel,Renske,Stephen,John,Joshua
LAST_NAME,OConnell,Grant,Whalen,Hartstein,Fay,Mavris,Baer,Higgins,Gietz,King,...,Marlow,Olson,Mallin,Rogers,Gee,Philtanker,Ladwig,Stiles,Seo,Patel
EMAIL,DOCONNEL,DGRANT,JWHALEN,MHARTSTE,PFAY,SMAVRIS,HBAER,SHIGGINS,WGIETZ,SKING,...,JAMRLOW,TJOLSON,JMALLIN,MROGERS,KGEE,HPHILTAN,RLADWIG,SSTILES,JSEO,JPATEL
PHONE_NUMBER,650.507.9833,650.507.9844,515.123.4444,515.123.5555,603.123.6666,515.123.7777,515.123.8888,515.123.8080,515.123.8181,515.123.4567,...,650.124.7234,650.124.8234,650.127.1934,650.127.1834,650.127.1734,650.127.1634,650.121.1234,650.121.2034,650.121.2019,650.121.1834
HIRE_DATE,21-JUN-07,13-JAN-08,17-SEP-03,17-FEB-04,17-AUG-05,07-JUN-02,07-JUN-02,07-JUN-02,07-JUN-02,17-JUN-03,...,16-FEB-05,10-APR-07,14-JUN-04,26-AUG-06,12-DEC-07,06-FEB-08,14-JUL-03,26-OCT-05,12-FEB-06,06-APR-06
JOB_ID,SH_CLERK,SH_CLERK,AD_ASST,MK_MAN,MK_REP,HR_REP,PR_REP,AC_MGR,AC_ACCOUNT,AD_PRES,...,ST_CLERK,ST_CLERK,ST_CLERK,ST_CLERK,ST_CLERK,ST_CLERK,ST_CLERK,ST_CLERK,ST_CLERK,ST_CLERK
SALARY,2600,2600,4400,13000,6000,6500,10000,12008,8300,24000,...,2500,2100,3300,2900,2400,2200,3600,3200,2700,2500
COMMISSION_PCT,-,-,-,-,-,-,-,-,-,-,...,-,-,-,-,-,-,-,-,-,-
MANAGER_ID,124,124,101,100,201,101,101,101,205,-,...,121,121,122,122,122,122,123,123,123,123
DEPARTMENT_ID,50,50,10,20,20,40,70,110,110,90,...,50,50,50,50,50,50,50,50,50,50

In [20]:
# creating a DataFrame and using apply function
import numpy as np
df1=pd.DataFrame(np.random.rand(5,3))
df1

          0         1         2
0  0.575284  0.324349  0.577709
1  0.869379  0.258355  0.248888
2  0.055578  0.234352  0.798240
3  0.748061  0.955845  0.084682
4  0.172862  0.227385  0.629662

In [ ]:
# apply fucntion take argument a function and applies that on top of a DATAFRAME    
df1.apply(lambda x:max(x))

0    0.869379
1    0.955845
2    0.798240
dtype: float64

In [22]:
df1.apply(lambda x:min(x))

0    0.055578
1    0.227385
2    0.084682
dtype: float64

In [23]:
df1.apply(lambda x: max(x)-min(x))

0    0.813800
1    0.728459
2    0.713558
dtype: float64

In [25]:
df1.apply(np.mean)

0    0.484233
1    0.400057
2    0.467836
dtype: float64

In [39]:
df1[0].apply(lambda x: x+3)
df1

          0         1         2
0  3.575284  0.324349  0.577709
1  3.869379  0.258355  0.248888
2  3.055578  0.234352  0.798240
3  3.748061  0.955845  0.084682
4  3.172862  0.227385  0.629662

In [47]:
df=df1[0].map(lambda x:x*100)
df

0    357.528372
1    386.937878
2    305.557850
3    374.806139
4    317.286219
Name: 0, dtype: float64